FemDesign.ModellingTools.ConnectedPoints.#ctor
Parameterless constructor for serialization

FemDesign.ModellingTools.ConnectedPoints.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Releases.RigidityDataType2,FemDesign.GuidListType[],System.String)
Create a connected point between 2 points using rigidity.

FemDesign.ModellingTools.ConnectedPoints.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Releases.Motions,FemDesign.Releases.Rotations,System.Collections.Generic.IEnumerable{FemDesign.EntityBase},System.String)
Create a connected point between 2 points with rigidity (motions, rotations).
firstPoint: First connected point
secondPoint: Second connected point
motions: Motions rigidity
rotations: Rotations rigidity
references: Reference element
identifier: Name of connected point

FemDesign.ModellingTools.ConnectedPoints.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Releases.Motions,FemDesign.Releases.Rotations,FemDesign.GuidListType[],System.String)
Create a connected point between 2 points with rigidity (motions, rotations).

FemDesign.ModellingTools.ConnectedPoints.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits,System.Collections.Generic.IEnumerable{FemDesign.EntityBase},System.String)
Create a connected point between 2 points with rigidity (motions, rotations) and plastic limits (forces, moments).

FemDesign.ModellingTools.ConnectedPoints.#ctor(FemDesign.Geometry.Point3d,FemDesign.Geometry.Point3d,FemDesign.Releases.Motions,FemDesign.Releases.MotionsPlasticLimits,FemDesign.Releases.Rotations,FemDesign.Releases.RotationsPlasticLimits,FemDesign.GuidListType[],System.String)
Create a connected point between 2 points with rigidity (motions, rotations) and plastic limits (forces, moments).